[
    {
        "version": "8.0.0",
        "msg": "Most notable changes:",
        "items": [
            "Made most of the content script features optional to reduce the overhead of the extension when used only for tab management"
        ]
    },
    {
        "version": "7.8.0",
        "msg": "Most notable changes:",
        "items": [
            "Made the in-page information panel more handy",
            "Search by name now also searches for update sets",
            "Search by name now takes '*' as a wildcard both at first and/or last positions"
        ]
    },
    {
        "version": "7.7.0",
        "msg": "Most notable changes:",
        "items": [
            "Added an information panel in the bottom left of the screen; you can remove it and reenable it from the options page",
            "Added a 'lang' command in the console to quickly switch language, for example 'lang fr'",
            "Changed the colors of the console to match current theme (light or dark)"
        ]
    },    {
        "version": "7.6.0",
        "msg": "Most notable changes:",
        "items": [
            "Added a CodeSearch-like feature in the console, use 'codesearch' of 'cs'",
            "Enhanced the console to make it resizable",
            "Search from the console now shows result previews for users and tasks",
            "Users can be searched by username, employee_number or email",
            "Switch to technical names is now supported in Workspaces"
        ]
    },
    {
        "version": "7.5.0",
        "msg": "Most notable changes:",
        "items": [
            "Added a nerdy console to access search faster and new features, check it out in the shortcuts!"
        ]
    },
    {
        "version": "7.4.0",
        "msg": "Most notable changes:",
        "items": [
            "Refactored how tab informations are gathered to make the extension popup lighter",
            "You can now search for any number handled by the sys_number mechanism",
            "Updated the popup window to use all available space when larger than 700px",
            "Updated the 'show update set' feature to make it a bit more useful"
        ]
    },
    {
        "version": "7.3.0",
        "msg": "Most notable changes:",
        "items": [
            "Enabled tab grouping for Firefox, if API is available",
            "Tweaked the icon coloring feature to keep the original icon shape"
        ]
    },
    {
        "version": "7.2.0",
        "msg": "Most notable changes:",
        "items": [
            "Added keyboard shortcuts button with live tooltip showing configured shortcuts",
            "Updated the 'show versions' feature (check your shortcuts!) to open any object incl. flows from designer"
        ]
    },
    {
        "version": "7.1.0",
        "msg": "Most notable changes:",
        "items": [
            "Removed the manual theme selection, the extension follows your browser preferences",
            "Made searching for sys_id a lot faster most of the time",
            "Added search for object names, sys_properties, tasks, users, ... Use '*' at the end for a 'STARTSWITH' search",
            "Corrected multiple issues when running the extension is an independant windows"
        ]
    },
    {
        "version": "7.0.0",
        "msg": "Most notable changes:",
        "items": [
            "Enhanced search: sys_id or object name, now available as a main toolbar button",
            "Organize tabs into groups with instance colors (when supported by browser)",
            "Light and Dark themes",
            "Background script popup is now using the new UI",
            "Display technical field names now works better",
            "Removed the auto-frame feature because it's implemented by SN now"
        ]
    },
    {
        "version": "6.1.0",
        "msg": "Most notable changes:",
        "items": [
            "Corrected a few issues following the manifest version upgrade."
        ]
    },
    {
        "version": "6.0.0",
        "msg": "Most notable changes:",
        "items": [
            "Upgraded manifest to v3. Not a big change from a user point of view but it was such a pain I thought it deserved its own major release.",
            "Not much more, to be honest. Please create issues on github if you see the extension misbehaving.",
            "If you are using extra-service-now.com domains, you may have to re-enable the option, so the extension requests the new, renamed authorization to access all urls."
        ]
    },
    {
        "version": "5.1.0",
        "msg": "Most notable changes:",
        "items": [
            "Finally made some updates required by the recent ServiceNow UI changes.",
            "Updated the documentation search link."
        ]
    },
    {
        "version": "5.0.0",
        "msg": "Most notable changes:",
        "items": [
            "Removed the broadest default permissions for the extension."
        ],
        "important": "You now have to <b>explicitly</b> allow the extension to be used outside of the service-now.com domain. \"Enable extra domains for content script\" in the options page if you want to use this feature. <br/>Just to be safe, remember you can use the export button in the options page to save your settings into a JSON file. You can import it back later in case of a bug or an issue with sync storage, or to copy your settings accross browsers."
    },
    {
        "version": "4.7.1",
        "msg": "Most notable changes:",
        "items": [
            "The previous background scripts are now selectable from a list.",
            "Make sure you configure your shortcuts in the <a href='#' class='shortcuts-config-link'>shortcuts configuration</a>."
        ]
    },
    {
        "version": "4.7.0",
        "msg": "Most notable changes:",
        "items": [
            "Enhanced the background script popup window with an execution history!",
            "Make sure you configure your shortcuts in the <a href='#' class='shortcuts-config-link'>shortcuts configuration</a>."
        ]
    }
]